module.exports = {
    article : function(req,res) {
        var id = req.param("id");
        res.locals.layout = "articleLayout";
        var data = {
            "01":{"title":"周报01 | 娱乐不是休息","desc":"如何更好的休息？ 、小夜灯 + 台灯（智能化控制）、吸奇不倒杯 、Mac上快递查询", "keyword":"娱乐不是休息"},
            "02":{"title":"周报02 | 防辐射蓝光眼镜","desc":"「一件你工作或生活中的健康好物？」乳胶枕、电动牙刷、泡脚片、黄老五花生酥、Keep、跳跳糖、HHKB、买买买购物助手", "keyword":"防辐射蓝光眼镜"},
            "03":{"title":"周报03 | 2016影响自己最大的一[书|观念|事]","desc":"《摄影笔记》、《你今天真好看》、《软技能-代码之外的生存指南》、《把时间当做朋友》、《微服务设计》等", "keyword":"影响自己最大的一[书|观念|事]"},
            "04":{"title":"周报04 | 推荐一款出行背包","desc":"生活和工作中，出行背包已经是每个人都会用到的物件。一款舒适的背包既满足物品携带的需求，也能体现自己的个性。下面几款是[健行]群内分享的背包，一起来看看吧。", "keyword":"出行背包"}
        };
        res.view('week/' + id, data[id]);
    }
};

